Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Unit API now properly handles plural strings.
sv: Unit API hanterar nu pluralstrÃ¤ngar korrekt.

source: Component creation can now handle ZIP file or document upload.
sv: Komponentskapande kan nu hantera ZIP-filer eller dokumentuppladdning.

source: Consolidated API response status codes.
sv: Konsoliderade API-svarskoder.

source: Support Markdown in contributor agreement.
sv: StÃ¶d Markdown i bidragaravtalet.

source: Improved source strings tracking.
sv: FÃ¶rbÃ¤ttrad spÃ¥rning av kÃ¤llstrÃ¤ngar.

source: Improved JSON, YAML and CSV formats compatibility.
sv: FÃ¶rbÃ¤ttrad kompatibilitet med JSON-, YAML- och CSV-format.

source: Added support for removing strings.
sv: Lagt till stÃ¶d fÃ¶r att ta bort strÃ¤ngar.

source: Improved performance of file downloads.
sv: FÃ¶rbÃ¤ttrad prestanda vid nedladdning av filer.

source: Improved repository management view.
sv: FÃ¶rbÃ¤ttrad vy fÃ¶r hantering av arkiv.

source: Automatically enable java-format for Android.
sv: Aktivera automatiskt Java-format fÃ¶r Android.

source: Added support for localized screenshots.
sv: Lagt till stÃ¶d fÃ¶r lokaliserade skÃ¤rmdumpar.

source: Added support for Python 3.9.
sv: Lagt till stÃ¶d fÃ¶r Python 3.9.

source: Fixed translating HTML files under certain conditions.
sv: Fixade Ã¶versÃ¤ttning av HTML-filer under vissa fÃ¶rhÃ¥llanden.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/53?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/53?closed=1>`__.

source: There are some changes in quality checks, you might want to include them in case you modified the :setting:`CHECK_LIST`.
sv: Det finns nÃ¥gra Ã¤ndringar i kvalitetskontrollerna, du kanske vill inkludera dem om du har modifierat :setting:`CHECK_LIST`.

source: The source language attribute was moved from project to a component what is exposed in the API. You will need to update :ref:`wlc` in case you are using it.
sv: KÃ¤llsprÃ¥ksattributet har flyttats frÃ¥n projektet till en komponent som exponeras i API:et. Du mÃ¥ste uppdatera :ref:`wlc` om du anvÃ¤nder det.

source: The database migration to 4.3 might take long depending on number of strings you are translating (expect around one hour of migration time per 100,000 source strings).
sv: DatabasÃ¶verfÃ¶ringen till 4.3 kan ta lÃ¥ng tid beroende pÃ¥ antalet strÃ¤ngar du Ã¶versÃ¤tter (rÃ¤kna med cirka en timmes Ã¶verfÃ¶ringstid per 100 000 kÃ¤llstrÃ¤ngar).

source: There is a change in :setting:`django:INSTALLED_APPS`.
sv: Det har skett en Ã¤ndring i :setting:`django:INSTALLED_APPS`.

source: There is a new setting :setting:`SESSION_COOKIE_AGE_AUTHENTICATED` which complements :setting:`django:SESSION_COOKIE_AGE`.
sv: Det finns en ny instÃ¤llning :setting:`SESSION_COOKIE_AGE_AUTHENTICATED` som kompletterar :setting:`django:SESSION_COOKIE_AGE`.

source: In case you were using :command:`hub` or :command:`lab` to integrate with GitHub or GitLab, you will need to reconfigure this, see :setting:`GITHUB_CREDENTIALS` and :setting:`GITLAB_CREDENTIALS`.
sv: Om du anvÃ¤nde :command:`hub` eller :command:`lab` fÃ¶r att integrera med GitHub eller GitLab mÃ¥ste du konfigurera om detta, se :setting:`GITHUB_CREDENTIALS` och :setting:`GITLAB_CREDENTIALS`.

source: The Celery configuration was changed to add ``memory`` queue. Please adjust your startup scripts and ``CELERY_TASK_ROUTES`` setting.
sv: Celery-konfigurationen har Ã¤ndrats fÃ¶r att lÃ¤gga till ``memory``-kÃ¶. Justera dina startskript och instÃ¤llningen ``CELERY_TASK_ROUTES``.

source: The ``post_update`` method of add-ons now takes extra ``skip_push`` parameter.
sv: Metoden ``post_update`` fÃ¶r tillÃ¤gg tar nu emot en extra parameter, ``skip_push``.

source: *Released on September 2nd 2020.*
sv: *SlÃ¤pptes den 2 september 2020.*

source: Fixed matching of source strings for JSON formats.
sv: Fast matchning av kÃ¤llstrÃ¤ngar fÃ¶r JSON-format.

source: Fixed login redirect for some authentication configurations.
sv: Fast inloggningsomdirigering fÃ¶r vissa autentiseringskonfigurationer.

source: Fixed LDAP authentication with group sync.
sv: Fixad LDAP-autentisering med gruppsynkronisering.

source: Fixed crash in reporting automatic translation progress.
sv: Fixat krasch vid rapportering av automatisk Ã¶versÃ¤ttningsprocess.

source: Fixed Git commit squashing with trailers enabled.
sv: Fixat Git-commit-squashing med trailers aktiverat.

source: Fixed creating local VCS components using the API.
sv: Fixat skapandet av lokala VCS-komponenter med hjÃ¤lp av API:et.

source: *Released on August 21st 2020.*
sv: *SlÃ¤pptes den 21 augusti 2020.*

source: Fixed saving plurals for some locales in Android resources.
sv: Fixade pluralformer fÃ¶r vissa sprÃ¥k i Android-resurser.

source: Fixed crash in the cleanup add-on for some XLIFF files.
sv: Fixat krasch i rengÃ¶ringstillÃ¤gget fÃ¶r vissa XLIFF-filer.

source: Allow setting up localization CDN in Docker image.
sv: TillÃ¥t instÃ¤llning av lokaliserings-CDN i Docker-bild.

source: *Released on August 18th 2020.*
sv: *SlÃ¤ppt den 18 augusti 2020.*

source: Improved user pages and added listing of users.
sv: FÃ¶rbÃ¤ttrade anvÃ¤ndarsidor och tillagd lista Ã¶ver anvÃ¤ndare.

source: Dropped support for migrating from 3.x releases, migrate through 4.1 or 4.0.
sv: StÃ¶det fÃ¶r migrering frÃ¥n 3.x-versioner har upphÃ¶rt. Migrera via 4.1 eller 4.0.

source: Added exports into several monolingual formats.
sv: Export till flera ensprÃ¥kiga format har lagts till.

source: Number of displayed nearby strings can be configured.
sv: Antalet strÃ¤ngar som visas i nÃ¤rheten kan konfigureras.

source: Added support for locking components experiencing repository errors.
sv: Lagt till stÃ¶d fÃ¶r lÃ¥sning av komponenter som upplever fel i arkivet.

source: Simplified main navigation (replaced buttons with icons).
sv: FÃ¶renklad huvudnavigering (knappar ersatta med ikoner).

source: Improved language code handling in Google Translate integration.
sv: FÃ¶rbÃ¤ttrad hantering av sprÃ¥kkoder i Google Translate-integrationen.

source: The Git squash add-on can generate ``Co-authored-by:`` trailers.
sv: TillÃ¤gget Git squash kan generera ``Co-authored-by:``-trailers.

source: Improved query search parser.
sv: FÃ¶rbÃ¤ttrad sÃ¶kmotor.

source: Improved user feedback from format strings checks.
sv: FÃ¶rbÃ¤ttrad anvÃ¤ndarfeedback frÃ¥n kontroll av formatstrÃ¤ngar.

source: Improved performance of bulk state changes.
sv: FÃ¶rbÃ¤ttrad prestanda vid bulkstatusÃ¤ndringar.

source: Added compatibility redirects after project or component renaming.
sv: Lagt till kompatibilitetsomdirigeringar efter namnbyte av projekt eller komponent.

source: Added notifications for strings approval, component locking and license change.
sv: Lagt till aviseringar fÃ¶r godkÃ¤nnande av strÃ¤ngar, lÃ¥sning av komponenter och licensÃ¤ndringar.

source: Added support for ModernMT.
sv: StÃ¶d fÃ¶r ModernMT har lagts till.

source: Allow to avoid overwriting approved translations on file upload.
sv: TillÃ¥t att godkÃ¤nda Ã¶versÃ¤ttningar inte skrivs Ã¶ver vid filuppladdning.

source: Dropped support for some compatibility URL redirects.
sv: StÃ¶det fÃ¶r vissa kompatibilitets-URL-omdirigeringar har tagits bort.

source: Added check for ECMAScript template literals.
sv: Lagt till kontroll fÃ¶r ECMAScript-mallliteraler.

source: Added option to watch a component.
sv: Lagt till mÃ¶jlighet att bevaka en komponent.

source: Removed leading dot from JSON unit keys.
sv: Borttagen inledande punkt frÃ¥n JSON-enhetsnycklar.

source: Removed separate Celery queue for translation memory.
sv: Separat Celery-kÃ¶ fÃ¶r Ã¶versÃ¤ttningsminne har tagits bort.

source: Allow translating all components a language at once.
sv: TillÃ¥t Ã¶versÃ¤ttning av alla komponenter till ett sprÃ¥k samtidigt.

source: Allow to configure ``Content-Security-Policy`` HTTP headers.
sv: TillÃ¥t konfigurering av HTTP-rubrikerna ``Content-Security-Policy``.

source: Added support for aliasing languages at project level.
sv: StÃ¶d fÃ¶r alias-sprÃ¥k pÃ¥ projektnivÃ¥ har lagts till.

source: New add-on to help with HTML or JavaScript localization, see :ref:`addon-weblate.cdn.cdnjs`.
sv: Nytt tillÃ¤gg som hjÃ¤lper till med lokalisering av HTML eller JavaScript, se :ref:`addon-weblate.cdn.cdnjs`.

source: The Weblate domain is now configured in the settings, see :setting:`SITE_DOMAIN`.
sv: Weblate-domÃ¤nen Ã¤r nu konfigurerad i instÃ¤llningarna, se :setting:`SITE_DOMAIN`.

source: Add support for searching by component and project.
sv: LÃ¤gg till stÃ¶d fÃ¶r sÃ¶kning efter komponent och projekt.

source: Upgrade from 3.x releases is not longer supported, please upgrade to 4.0 or 4.1 first.
sv: Uppgradering frÃ¥n version 3.x stÃ¶ds inte lÃ¤ngre. Uppgradera fÃ¶rst till version 4.0 eller 4.1.

source: There are some new and updated requirements.
sv: Det finns nÃ¥gra nya och uppdaterade krav.

source: There are several changes in :file:`settings_example.py`, most notable new middleware and changed application ordering.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, framfÃ¶r allt ny mellanprogramvara och Ã¤ndrad applikationsordning.

source: The keys for JSON based formats no longer include leading dot. The strings are adjusted during the database migration, but external components might need adjustment in case you rely on keys in exports or API.
sv: Nycklarna fÃ¶r JSON-baserade format innehÃ¥ller inte lÃ¤ngre inledande punkt. StrÃ¤ngarna justeras under databasmigreringen, men externa komponenter kan behÃ¶va justeras om du Ã¤r beroende av nycklar i export eller API.

source: The Celery configuration was changed to no longer use ``memory`` queue. Please adjust your startup scripts and ``CELERY_TASK_ROUTES`` setting.
sv: Celery-konfigurationen har Ã¤ndrats sÃ¥ att den inte lÃ¤ngre anvÃ¤nder ``memory``-kÃ¶n. Justera dina startskript och instÃ¤llningen ``CELERY_TASK_ROUTES``.

source: The Weblate domain is now configured in the settings, see :setting:`SITE_DOMAIN` (or :envvar:`WEBLATE_SITE_DOMAIN`). You will have to configure it before running Weblate.
sv: Weblate-domÃ¤nen Ã¤r nu konfigurerad i instÃ¤llningarna, se :setting:`SITE_DOMAIN` (eller :envvar:`WEBLATE_SITE_DOMAIN`). Du mÃ¥ste konfigurera den innan du kÃ¶r Weblate.

source: The username and email fields on user database now should be case insensitive unique. It was mistakenly not enforced with PostgreSQL.
sv: AnvÃ¤ndarnamnet och e-postadressen i anvÃ¤ndardatabasen ska nu vara unika och inte skilja mellan stora och smÃ¥ bokstÃ¤ver. Detta tillÃ¤mpades felaktigt inte med PostgreSQL.

source: *Released on June 19th 2020.*
sv: *SlÃ¤pptes den 19 juni 2020.*

source: Fixed changing autofix or add-ons configuration in Docker.
sv: Fixat Ã¤ndring av autofix eller tillÃ¤ggskonfiguration i Docker.

source: Fixed possible crash in "About" page.
sv: Fixat mÃ¶jligt krasch i "Om"-sidan.

source: Improved installation of byte-compiled locale files.
sv: FÃ¶rbÃ¤ttrad installation av byte-kompilerade lokaliseringsfiler.

source: Fixed adding words to glossary.
sv: Fixat tillÃ¤gg av ord till ordlistan.

source: Fixed keyboard shortcuts for machinery.
sv: Fasta kortkommandon fÃ¶r maskiner.

source: Removed debugging output causing discarding log events in some setups.
sv: Borttagen felsÃ¶kningsutdata som orsakade att logghÃ¤ndelser kasserades i vissa instÃ¤llningar.

source: Fixed lock indication on project listing.
sv: Fast lÃ¥sindikering pÃ¥ projektlistan.

source: Fixed listing GPG keys in some setups.
sv: Fasta GPG-nycklar i vissa instÃ¤llningar.

source: Added option for which DeepL API version to use.
sv: Lagt till alternativ fÃ¶r vilken DeepL API-version som ska anvÃ¤ndas.

source: Added support for acting as SAML Service Provider, see :ref:`saml-auth`.
sv: Lagt till stÃ¶d fÃ¶r att fungera som SAML-tjÃ¤nsteleverantÃ¶r, se :ref:`saml-auth`.

source: *Released on June 15th 2020.*
sv: *SlÃ¤pptes den 15 juni 2020.*

source: Added support for creating new translations with included country code.
sv: Lagt till stÃ¶d fÃ¶r att skapa nya Ã¶versÃ¤ttningar med inkluderad landskod.

source: Added support for searching source strings with screenshot.
sv: Lagt till stÃ¶d fÃ¶r sÃ¶kning av kÃ¤llstrÃ¤ngar med skÃ¤rmdump.

source: Extended info available in the stats insights.
sv: Mer information finns i statistikinsikterna.

source: Improved search editing on "Translate" pages.
sv: FÃ¶rbÃ¤ttrad sÃ¶kredigering pÃ¥ "ÃversÃ¤tt"-sidor.

source: Improve handling of concurrent repository updates.
sv: FÃ¶rbÃ¤ttra hanteringen av samtidiga uppdateringar av arkivet.

source: Include source language in project creation form.
sv: Inkludera kÃ¤llsprÃ¥ket i formulÃ¤ret fÃ¶r projektupprÃ¤ttande.

source: Include changes count in credits.
sv: Inkludera Ã¤ndringsantalet i krediter.

source: Fixed UI language selection in some cases.
sv: Fixat val av UI-sprÃ¥k i vissa fall.

source: Possibility to allow certain registration methods with registrations closed.
sv: MÃ¶jlighet att tillÃ¥ta vissa registreringsmetoder nÃ¤r registreringen Ã¤r stÃ¤ngd.

source: Improved lookup of related terms in glossary.
sv: FÃ¶rbÃ¤ttrad sÃ¶kning av relaterade termer i ordlistan.

source: Improved translation memory matches.
sv: FÃ¶rbÃ¤ttrade matchningar i Ã¶versÃ¤ttningsminnet.

source: Group same machinery results.
sv: Gruppera samma maskinresultat.

source: Add direct link to edit screenshot from translate page.
sv: LÃ¤gg till direktlÃ¤nk fÃ¶r att redigera skÃ¤rmdump frÃ¥n Ã¶versÃ¤ttningssidan.

source: Improved removal confirmation dialog.
sv: FÃ¶rbÃ¤ttrad dialogruta fÃ¶r bekrÃ¤ftelse av borttagning.

source: Include templates in ZIP download.
sv: Inkludera mallar i ZIP-nedladdningen.

source: Add support for Markdown and notification configuration in announcements.
sv: LÃ¤gg till stÃ¶d fÃ¶r Markdown och konfiguration av aviseringar i meddelanden.

source: Extended details in check listings.
sv: UtÃ¶kade detaljer i checklistor.

source: Added support for new file formats: :ref:`laravel-php`, :ref:`html`, :ref:`odf`, :ref:`idml`, :ref:`winrc`, :ref:`ini`, :ref:`islu`, :ref:`gwt`, :ref:`go-i18n-json`, :ref:`arb`.
sv: StÃ¶d fÃ¶r nya filformat har lagts till: :ref:`laravel-php`, :ref:`html`, :ref:`odf`, :ref:`idml`, :ref:`winrc`, :ref:`ini`, :ref:`islu`, :ref:`gwt`, :ref:`go-i18n-json`, :ref:`arb`.

source: Consistently use dismissed as state of dismissed checks.
sv: AnvÃ¤nd konsekvent avvisade som avvisade kontroller.

source: Add support for configuring default add-ons to enable.
sv: LÃ¤gg till stÃ¶d fÃ¶r konfigurering av standardtillÃ¤gg som ska aktiveras.

source: Fixed editor keyboard shortcut to dismiss checks.
sv: Fixat tangentbordsgenvÃ¤g fÃ¶r redaktÃ¶ren fÃ¶r att avvisa kontroller.

source: Improved machine translation of strings with placeholders.
sv: FÃ¶rbÃ¤ttrad maskinÃ¶versÃ¤ttning av strÃ¤ngar med platshÃ¥llare.

source: Show ghost translation for user languages to ease starting them.
sv: Visa Ã¶versÃ¤ttning fÃ¶r anvÃ¤ndarsprÃ¥k fÃ¶r att underlÃ¤tta starten.

source: Improved language code parsing.
sv: FÃ¶rbÃ¤ttrad sprÃ¥kkodanalys.

source: Show translations in user language first in the list.
sv: Visa Ã¶versÃ¤ttningar pÃ¥ anvÃ¤ndarens sprÃ¥k fÃ¶rst i listan.

source: Renamed shapings to more generic name variants.
sv: OmdÃ¶pt shapings till mer generiska namnvarianter.

source: Added new quality checks: :ref:`check-unnamed-format`, :ref:`check-long-untranslated`, :ref:`check-duplicate`.
sv: Nya kvalitetskontroller har lagts till: :ref:`check-unnamed-format`, :ref:`check-long-untranslated`, :ref:`check-duplicate`.

source: Reintroduced support for wiping translation memory.
sv: Ã terinfÃ¶rt stÃ¶d fÃ¶r radering av Ã¶versÃ¤ttningsminne.

source: Fixed option to ignore source checks.
sv: Fast alternativ fÃ¶r att ignorera kÃ¤llkontroller.

source: Added support for configuring different branch for pushing changes.
sv: Lagt till stÃ¶d fÃ¶r att konfigurera olika grenar fÃ¶r att skicka Ã¤ndringar.

source: API now reports rate limiting status in the HTTP headers.
sv: API rapporterar nu status fÃ¶r hastighetsbegrÃ¤nsning i HTTP-rubrikerna.

source: Added support for Google Translate V3 API (Advanced).
sv: StÃ¶d fÃ¶r Google Translate V3 API (avancerat) har lagts till.

source: Added ability to restrict access on component level.
sv: Lagt till mÃ¶jlighet att begrÃ¤nsa Ã¥tkomst pÃ¥ komponentnivÃ¥.

source: Added support for whitespace and other special chars in translation flags, see :ref:`custom-checks`.
sv: Lagt till stÃ¶d fÃ¶r blanksteg och andra specialtecken i Ã¶versÃ¤ttningsflaggor, se :ref:`custom-checks`.

source: Always show rendered text check if enabled.
sv: Visa alltid renderad text om funktionen Ã¤r aktiverad.

source: API now supports filtering of changes.
sv: API stÃ¶der nu filtrering av Ã¤ndringar.

source: Added support for sharing glossaries between projects.
sv: Lagt till stÃ¶d fÃ¶r delning av ordlistor mellan projekt.

source: There are several changes in :file:`settings_example.py`, most notable middleware changes, please adjust your settings accordingly.
sv: Det finns flera Ã¤ndringar i :file:`settings_example.py`, framfÃ¶r allt Ã¤ndringar i mellanprogramvaran. Justera dina instÃ¤llningar dÃ¤refter.

source: There are new quality checks, you might want to include them in case you modified the :setting:`CHECK_LIST`.
sv: Det finns nya kvalitetskontroller, du kanske vill inkludera dem om du har modifierat :setting:`CHECK_LIST`.

source: There is change in ``DEFAULT_THROTTLE_CLASSES`` setting to allow reporting of rate limiting in the API.
sv: Det har skett en Ã¤ndring i instÃ¤llningen ``DEFAULT_THROTTLE_CLASSES`` fÃ¶r att mÃ¶jliggÃ¶ra rapportering av hastighetsbegrÃ¤nsning i API:et.

source: The ``MT_DEEPL_API_VERSION`` setting has been removed in Version 4.7. The :ref:`mt-deepl` machine translation now uses the new ``MT_DEEPL_API_URL`` instead. You might need to adjust ``MT_DEEPL_API_URL`` to match your subscription.
sv: InstÃ¤llningen ``MT_DEEPL_API_VERSION`` har tagits bort i version 4.7. MaskinÃ¶versÃ¤ttningen :ref:`mt-deepl` anvÃ¤nder nu istÃ¤llet den nya ``MT_DEEPL_API_URL``. Du kan behÃ¶va justera ``MT_DEEPL_API_URL`` sÃ¥ att den stÃ¤mmer Ã¶verens med ditt abonnemang.

source: *Released on May 7th 2020.*
sv: *SlÃ¤pptes den 7 maj 2020.*

source: Fixed testsuite execution on some Python 3.8 environments.
sv: Fixat testsuite-kÃ¶rning pÃ¥ vissa Python 3.8-miljÃ¶er.

source: Typo fixes in the documentation.
sv: RÃ¤ttelser av stavfel i dokumentationen.

source: Fixed creating components using the API in some cases.
sv: Fixade skapandet av komponenter med hjÃ¤lp av API i vissa fall.

source: Fixed JavaScript errors breaking mobile navigation.
sv: Fixade JavaScript-fel som stÃ¶rde mobilnavigeringen.

source: Fixed crash on displaying some checks.
sv: Fixat krasch vid visning av vissa kontroller.

source: Fixed screenshots listing.
sv: FaststÃ¤lld lista Ã¶ver skÃ¤rmdumpar.

source: Fixed monthly digest notifications.
sv: Fasta mÃ¥natliga sammanfattningsmeddelanden.

source: Fixed intermediate translation behavior with units non existing in translation.
sv: Fixat mellanliggande Ã¶versÃ¤ttningsbeteende med enheter som inte finns i Ã¶versÃ¤ttningen.

source: *Released on May 2nd 2020.*
sv: *SlÃ¤pptes den 2 maj 2020.*

source: Fixed possible crash in reports.
sv: Fixat mÃ¶jligt krasch i rapporter.

source: User mentions in comments are now case insensitive.
sv: AnvÃ¤ndaromnÃ¤mnanden i kommentarer Ã¤r nu skiftlÃ¤gesokÃ¤nsliga.

source: Fixed PostgreSQL migration for non superusers.
sv: Fixad PostgreSQL-migrering fÃ¶r icke-superanvÃ¤ndare.

source: Fixed changing the repository URL while creating component.
sv: Fixat Ã¤ndring av repositoriets URL vid skapande av komponent.

source: Fixed crash when upstream repository is gone.
sv: Fixat krasch nÃ¤r uppstrÃ¶msrepositoriet Ã¤r borta.

source: *Released on April 27th 2020.*
sv: *SlÃ¤pptes den 27 april 2020.*

source: Improved performance of translation stats.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r Ã¶versÃ¤ttningsstatistik.

source: Improved performance of changing labels.
sv: FÃ¶rbÃ¤ttrad prestanda vid byte av etiketter.

source: Fixed possible crash on component deletion.
sv: Fixat mÃ¶jligt krasch vid borttagning av komponenter.

source: Fixed displaying of translation changes in some corner cases.
sv: Fixat visning av Ã¶versÃ¤ttningsÃ¤ndringar i vissa specialfall.

source: Improved warning about too long celery queue.
sv: FÃ¶rbÃ¤ttrad varning om fÃ¶r lÃ¥ng selleri-kÃ¶.

source: Fixed possible false positives in the consistency check.
sv: RÃ¤ttade mÃ¶jliga falska positiva resultat i konsistenskontrollen.

source: Fixed deadlock when changing linked component repository.
sv: Ã tgÃ¤rdat dÃ¶dlÃ¤ge vid byte av lÃ¤nkat komponentarkiv.

source: Included edit distance in changes listing and CSV and reports.
sv: Inkluderade redigeringsavstÃ¥nd i Ã¤ndringslistan, CSV-filer och rapporter.

source: Avoid false positives of punctuation spacing check for Canadian French.
sv: Undvik falska positiva resultat vid kontroll av avstÃ¥nd mellan skiljetecken fÃ¶r kanadensisk franska.

source: Fixed XLIFF export with placeholders.
sv: Fixat XLIFF-export med platshÃ¥llare.

source: Fixed false positive with zero width check.
sv: Fixat falskt positivt resultat med nollbreddskontroll.

source: Improved reporting of configuration errors.
sv: FÃ¶rbÃ¤ttrad rapportering av konfigurationsfel.

source: Fixed bilingual source upload.
sv: Fast tvÃ¥sprÃ¥kig kÃ¤lluppladdning.

source: Automatically detect supported languages for DeepL machine translation.
sv: Automatiskt upptÃ¤cka sprÃ¥k som stÃ¶ds fÃ¶r DeepL maskinÃ¶versÃ¤ttning.

source: Fixed progress bar display in some corner cases.
sv: Fixat visning av fÃ¶rloppsindikatorn i vissa specialfall.

source: Fixed some checks triggering on non translated strings.
sv: Fixade nÃ¥gra kontroller som utlÃ¶stes pÃ¥ icke Ã¶versatta strÃ¤ngar.

source: *Released on April 16th 2020.*
sv: *SlÃ¤pptes den 16 april 2020.*

source: Fixed package installation from PyPI.
sv: Fast paketinstallation frÃ¥n PyPI.

source: Weblate now requires Python 3.6 or newer.
sv: Weblate krÃ¤ver nu Python 3.6 eller nyare.

source: Added management overview of component alerts.
sv: Lagt till Ã¶versikt Ã¶ver komponentvarningar fÃ¶r ledningen.

source: Added component alert for broken repository browser URLs.
sv: Lagt till komponentvarning fÃ¶r trasiga URL-adresser i arkivblÃ¤ddraren.

source: Improved sign in and registration pages.
sv: FÃ¶rbÃ¤ttrade inloggnings- och registreringssidor.

source: Project access control and workflow configuration integrated to project settings.
sv: ProjektÃ¥tkomstkontroll och arbetsflÃ¶deskonfiguration integrerad i projektinstÃ¤llningarna.

source: Added check and highlighter for i18next interpolation and nesting.
sv: Lagt till kontroll och markering fÃ¶r i18next-interpolering och kapsling.

source: Added check and highlighter for percent placeholders.
sv: Lagt till kontroll och markering fÃ¶r procentuella platshÃ¥llare.

source: Display suggestions failing checks.
sv: VisningsfÃ¶rslag klarar inte kontrollerna.

source: Record source string changes in history.
sv: Registrera Ã¤ndringar av kÃ¤llstrÃ¤ngen i historiken.

source: Upgraded Microsoft Translator to version 3 API.
sv: Uppgraderat Microsoft Translator till version 3 API.

source: Reimplemented translation memory backend.
sv: Omimplementerad Ã¶versÃ¤ttningsminnesbackend.

source: Added support for several ``is:`` lookups in :doc:`/user/search`.
sv: Lagt till stÃ¶d fÃ¶r flera ``is:``-sÃ¶kningar i :doc:`/user/search`.

source: Allow to make :ref:`check-same` avoid the built-in words exceptions.
sv: TillÃ¥t att :ref:`check-same` undviker undantagen fÃ¶r inbyggda ord.

source: Improved comments extraction from monolingual po files.
sv: FÃ¶rbÃ¤ttrad extrahering av kommentarer frÃ¥n ensprÃ¥kiga po-filer.
